app/views/companies/_unfollow.html.erb

<%= form_for current_user.relationships.find_by_company_id(company_id),
             :html => { :method => :delete } do |f| %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."company_id" = 2 AND ("relationships".user_id = 9) LIMIT 1