app/controllers/authentications_controller.rb

  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'twitter' AND "authentications"."uid" = '233627348' LIMIT 1