app/controllers/pages_controller.rb

  def home
    @authentications =current_user.authentications if current_user
		if user_signed_in?

		elsif company_signed_in?
			@event = Event.new
			@events = current_company.events.paginate(:page => params[:page])
---
SELECT "events".* FROM "events" WHERE ("events".company_id = 2) ORDER BY events.date