app/controllers/registrations_controller.rb

  def create
    super
    session[:omniauth] = nil unless @user.new_record?
    if session[:unreg_user]
      @remote_user = RemoteUser.find_by_email(session[:unreg_user][:email])
      @user.address = @remote_user.address
      for c in @remote_user.companies
        @user.relationships.create(:company_id => c.id)
      end
      @user.save
      @remote_user.destroy #remove for debugging
---
SELECT "remote_users".* FROM "remote_users" WHERE "remote_users"."email" = 'd.reinhold@yahoo.com' LIMIT 1
SELECT 1 FROM "users" WHERE ("users"."email" = 'd.reinhold@yahoo.com') AND ("users".id <> 10) LIMIT 1
INSERT INTO "relationships" ("user_id", "company_id", "created_at", "updated_at") VALUES (9, 2, '2011-06-16 03:10:27.626642', '2011-06-16 03:10:27.626642') RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "created_at", "updated_at", "name", "address", "admin", "latitude", "longitude", "radius") VALUES ('d.reinhold@yahoo.com', '$2a$10$Ixh1RiqHNipXFAxV6.n4jOA6Zasr2VmuPYcO9bo.mawgklTukCm6O', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, 'byy8dLaH66NSFgbJqOlY', NULL, '2011-07-18 05:45:07.012224', '2011-07-18 05:45:07.012608', '2011-07-18 05:45:07.012608', 'Dominick Reinhold', '413 4th Ave, Collins, IA 50055', 'f', 41.903052, -93.303645, 30) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2011-06-15 18:07:13.326838', "current_sign_in_at" = '2011-06-15 18:07:13.326838', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2011-06-15 18:07:13.328897' WHERE "users"."id" = 2
DELETE FROM "remote_users" WHERE "remote_users"."id" = 4