app/controllers/remote_users_controller.rb

SELECT "remote_users".* FROM "remote_users" WHERE "remote_users"."email" = 'd.reinhold@yahoo.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
  def transform
    temp = RemoteUser.find_by_email(params[:remote_user][:email])

SELECT "companies".* FROM "companies" WHERE "companies"."company_name" = 'Lil Wayne' LIMIT 1
SELECT "remote_users".* FROM "remote_users" WHERE "remote_users"."email" = 'foo@bar.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'foo@bar.com' LIMIT 1
INSERT INTO "remote_users" ("email", "address", "latitude", "longitude", "created_at", "updated_at") VALUES ('foo@bar.com', '413 4th Avenue', 32.227058, -110.965714, '2011-06-15 05:56:32.459392', '2011-06-15 05:56:32.459392') RETURNING "id"
---
  def create
    @email = (params[:remote_user][:email])
    @company = Company.find_by_company_name(params[:remote_user][:remote_company])
    unless @company.nil?
      @user = User.find_by_email(@email)
      if @user.nil? # This email is not registered to a full user on the site
        @remote_user = RemoteUser.find_by_email(@email)
        if @remote_user.nil? # This email hasn't been used on a remote form before
          @remote_user = RemoteUser.new(params[:remote_user])
          if @remote_user.save