app/controllers/users_controller.rb

 def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
    @remote_users = RemoteUser.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT "remote_users".* FROM "remote_users" LIMIT 30 OFFSET 0